export type IUnRead = 
     "--"
    |"מקום סגור" 
    |"מונה הוסר"
    |"אין מפתח לארון"
    |"לא נמצא"
    |"אין מענה"
    |"אין מענה ונשלח הודעה"
    |"התנגדות"
    |"יש כלב שמפריע"
    |"דיווח עצמאי"
    |"פירוט בהודעות"
;

let unReadType = [
         "--"
         ,"אין מענה"
         ,"לא נמצא"
         ,"מקום סגור" 
         ,"אין מענה ונשלח הודעה"
         ,"דיווח עצמאי"
         ,"יש כלב שמפריע"
         ,"פירוט בהודעות"
         ,"אין מפתח לארון"
        ,"מונה הוסר"
        ,"התנגדות"
]

export {unReadType}