import IMone from "./interface/IMone";

export function messageRead(mone:IMone){
    return  `שלום ${mone.name || ""},
אני חיים קורא מונים מטעם חברת החשמל.

אני צריך לצלם את המונה חשמל אצלך ב:
*עיר*: ${mone.city}
*רחוב*: ${mone.street ||"לא-רשום"} ${mone.streetNumber|| ""}
*מיקום המונה*: ${mone.location=="--" ?"בפנים" :mone.location}
*חמש ספרות אחרונות של המונה*: ${mone.number}

*אם הפרטים הרשומים אצלי שגויים אנא תקן אותי כאן בוואצאפ או צור איתי קשר טלפונית.*
ניתן לצלם ידנית את המונה ולשלוח כאן עד השעה 20:00 ובכך לחסוך לי הגעה :)

אם לא אצליח במהלך היום להגיע ואין באפשרותך לצלם, אוכל להדריך אותך כיצד לדווח עצמאית לחברת החשמל

בתודה,
חיים דדון.`;
}

export function messageUnRead(mone:IMone){
    return  `שלום ${mone.name || ""},
אני חיים קורא מונים מטעם חברת החשמל.

לאחר חיפושים באזור מגורך לא הצלחתי למצוא את המונה חשמל. 
יתכן שהפרטים אצלי שגויים או שהמונה בתוך הבית ואין לי גישה אליו.

על פי הנתונים הרשומים אצלי. המונה נמצא ב:
*עיר*: ${mone.city}
*רחוב*: ${mone.street ||"לא-רשום"} ${mone.streetNumber||""}
*מיקום המונה*: ${mone.location=="--" ?"בפנים" :mone.location}
*חמש ספרות אחרונות של המונה*: ${mone.number}

*אם הפרטים הרשומים אצלי שגויים אנא תקן אותי כאן בוואצאפ או צור איתי קשר טלפונית.*
ניתן לצלם ידנית את המונה ולשלוח כאן עד השעה 20:00 ובכך לחסוך לי הגעה :)

אם לא אצליח במהלך היום להגיע ואין באפשרותך לצלם, אוכל להדריך אותך כיצד לדווח עצמאית לחברת החשמל

בתודה,
חיים דדון.`;
}